Autodesk.Revit.DB.ScheduleFilter.SetValue(Autodesk.Revit.DB.ElementId)
Set the filter value to an ElementId.
id:
The filter value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.ScheduleFilter.SetValue(System.String)
Set the filter value to a string.
string:
The filter value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.ScheduleFilter.SetValue(System.Double)
Set the filter value to a double.
value:
The filter value.
Since:
2013

Autodesk.Revit.DB.ScheduleFilter.SetValue(System.Int32)
Set the filter value to an integer.
value:
The filter value.
Since:
2013

Autodesk.Revit.DB.ScheduleFilter.SetNullValue
Sets the filter to have no specified value (used for HasParameter filters).
Since:
2013

Autodesk.Revit.DB.ScheduleFilter.GetElementIdValue
Gets the filter value for a filter using an ElementId value.
Returns:
The filter value.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The filter value is not an ElementId.
Since:
2013

Autodesk.Revit.DB.ScheduleFilter.GetStringValue
Gets the filter value for a filter using a string value.
Returns:
The filter value.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The filter value is not a string.
Since:
2013

Autodesk.Revit.DB.ScheduleFilter.GetDoubleValue
Gets the filter value for a filter using a double value.
Returns:
The filter value.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The filter value is not a double.
Since:
2013

Autodesk.Revit.DB.ScheduleFilter.GetIntegerValue
Gets the filter value for a filter using an integer value.
Returns:
The filter value.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The filter value is not an integer.
Since:
2013

Autodesk.Revit.DB.ScheduleFilter.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ScheduleFilter.IsElementIdValue
Indicates if the filter has an ElementId value.
Since:
2013

Autodesk.Revit.DB.ScheduleFilter.IsDoubleValue
Indicates if the filter has a double value.
Since:
2013

Autodesk.Revit.DB.ScheduleFilter.IsStringValue
Indicates if the filter has a string value.
Since:
2013

Autodesk.Revit.DB.ScheduleFilter.IsIntegerValue
Indicates if the filter has an integer value.
Since:
2013

Autodesk.Revit.DB.ScheduleFilter.IsNullValue
Indicates if the filter has no specified value.
Since:
2013

Autodesk.Revit.DB.ScheduleFilter.FilterType
The filter type.
Remarks:
See ScheduleFilterType for details.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.ScheduleFilter.FieldId
The ID of the field used to filter the schedule.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.ScheduleFilter.#ctor(Autodesk.Revit.DB.ScheduleFieldId,Autodesk.Revit.DB.ScheduleFilterType,Autodesk.Revit.DB.ElementId)
Creates a new ScheduleFilter.
fieldId:
The ID of the field used to filter the schedule.
filterType:
The filter type.
value:
The filter value for a filter using an ElementId value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.ScheduleFilter.#ctor(Autodesk.Revit.DB.ScheduleFieldId,Autodesk.Revit.DB.ScheduleFilterType,System.String)
Creates a new ScheduleFilter.
fieldId:
The ID of the field used to filter the schedule.
filterType:
The filter type.
value:
The filter value for a filter using a string value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.ScheduleFilter.#ctor(Autodesk.Revit.DB.ScheduleFieldId,Autodesk.Revit.DB.ScheduleFilterType,System.Double)
Creates a new ScheduleFilter.
fieldId:
The ID of the field used to filter the schedule.
filterType:
The filter type.
value:
The filter value for a filter using a double value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.ScheduleFilter.#ctor(Autodesk.Revit.DB.ScheduleFieldId,Autodesk.Revit.DB.ScheduleFilterType,System.Int32)
Creates a new ScheduleFilter.
fieldId:
The ID of the field used to filter the schedule.
filterType:
The filter type.
value:
The filter value for a filter using an integer value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.ScheduleFilter.#ctor(Autodesk.Revit.DB.ScheduleFieldId,Autodesk.Revit.DB.ScheduleFilterType)
Creates a new ScheduleFilter.
fieldId:
The ID of the field used to filter the schedule.
filterType:
The filter type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.ScheduleFilter.#ctor
Creates a new ScheduleFilter.
Since:
2013

Autodesk.Revit.DB.ScheduleFilter
A filter in a schedule.
Remarks:
The ScheduleFilter class represents a single filter in a schedule.
A filter is a condition that must be satisfied for an element to
appear in the schedule.  All filters must be satisfied for an element
to appear in the schedule.
A schedule can be filtered by data that is not displayed
in the schedule by marking the field used for filtering as hidden
using the ScheduleField.IsHidden property.
Since:
2013